// Filter constants based on backend mappers

export const DISTRICTS = [
  { value: 'Железнодорожный 🚤', label: 'Железнодорожный' },
  { value: 'Левобережный ✈️', label: 'Левобережный' },
  { value: 'Центральный 🏘', label: 'Центральный' },
  { value: 'Советский 🏡', label: 'Советский' },
  { value: 'Коминтерновский 🐱', label: 'Коминтерновский' },
  { value: 'Ленинский 🎪', label: 'Ленинский' },
  { value: 'За городом 🏞', label: 'За городом' },
  { value: 'ВСЕ РАЙОНЫ ♾️', label: 'Все районы' },
];

export const PLACE_TYPES = [
  { value: 'Уличная спортивная площадка 🏖', label: 'Уличная площадка' },
  { value: 'Футбольное поле ⚽️', label: 'Футбольное поле' },
  { value: 'Баскетбольное поле 🏀', label: 'Баскетбольное поле' },
  { value: 'Волейбольное поле 🏐', label: 'Волейбольное поле' },
  { value: 'Теннисный корт 🎾', label: 'Теннисный корт' },
  { value: 'Пинг-понг стол 🏓', label: 'Пинг-понг стол' },
  { value: 'Падел корт 🥎', label: 'Падел корт' },
  { value: 'Ледовая арена 🏒', label: 'Ледовая арена' },
  { value: 'Бассейн 🏊‍♂️', label: 'Бассейн' },
  { value: 'Беговая зона 🏃', label: 'Беговая зона' },
  { value: 'Зал для единоборств 🥋', label: 'Зал единоборств' },
  { value: 'Тренажерный зал 🏋️‍♀️', label: 'Тренажерный зал' },
];

export const OUTDOOR_OPTIONS = [
  { value: 'Улица 🏜', label: 'На улице' },
  { value: 'Помещение 🏛', label: 'В помещении' },
];

export const SPORT_TYPES = [
  { value: 'Футбол', label: 'Футбол' },
  { value: 'Волейбол', label: 'Волейбол' },
  { value: 'Хоккей', label: 'Хоккей' },
  { value: 'ММА', label: 'ММА' },
  { value: 'Бокс', label: 'Бокс' },
  { value: 'Баскетбол', label: 'Баскетбол' },
  { value: 'Падел', label: 'Падел' },
  { value: 'Пинг-понг', label: 'Пинг-понг' },
  { value: 'Теннис', label: 'Теннис' },
  { value: 'Джиу-Джитсу', label: 'Джиу-Джитсу' },
  { value: 'Борьба', label: 'Борьба' },
  { value: 'Фитнес', label: 'Фитнес' },
  { value: 'Плаванье', label: 'Плаванье' },
  { value: 'Нутрициология', label: 'Нутрициология' },
  { value: 'Бег', label: 'Бег' },
  { value: 'Воркаут', label: 'Воркаут' },
  { value: 'Лыжи', label: 'Лыжи' },
  { value: 'Фигурное катание', label: 'Фигурное катание' },
  { value: 'Гимнастика', label: 'Гимнастика' },
  { value: 'Растяжка', label: 'Растяжка' },
  { value: 'Йога', label: 'Йога' },
  { value: 'Групповые тренировки', label: 'Групповые тренировки' },
  { value: 'Легкая атлетика', label: 'Легкая атлетика' },
];

export const SEX_OPTIONS = [
  { value: 'Мужчина', label: 'Мужчина' },
  { value: 'Женщина', label: 'Женщина' },
];
